# SetDrawingRect

## Description
Sets the size of the drawing rectangle.

```pascal
PROCEDURE SetDrawingRect(
				paperWidth  : REAL;
				paperHeight : REAL);
```

```python
def vs.SetDrawingRect(paperWidth, paperHeight):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paperWidth|REAL|The width of the drawing rectangle|
|paperHeight|REAL|The height of the drawing rectangle|

## See Also
VS Functions:
GetDrawingSizeRect

## Version
Availability: from VectorWorks 10.0

## Category
* Utility